Revit 2027 API
ExternalServices.BuiltInExternalServices.PathOfTravelCalculationService Property
 Autodesk Internal: The service for path of travel calculations
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId PathOfTravelCalculationService { get; }
Public Shared ReadOnly Property PathOfTravelCalculationService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ PathOfTravelCalculationService {
	ExternalServiceId^ get ();
}
static member PathOfTravelCalculationService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace